In [1]:
import numpy as np
import pandas as pd

In [11]:
data = { 'Company':['GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FACEBOOK','FACEBOOK'],
         'Person':['Sam','Charlie','Amy','Venessa','Carl','Sarah'],
         'Sales':[200,120,340,124,243,350]}

In [12]:
df = pd.DataFrame(data)

In [13]:
df

     Company   Person  Sales
0     GOOGLE      Sam    200
1     GOOGLE  Charlie    120
2  MICROSOFT      Amy    340
3  MICROSOFT  Venessa    124
4   FACEBOOK     Carl    243
5   FACEBOOK    Sarah    350

In [14]:
bycomp = df.groupby('Company')

In [15]:
bycomp

In [16]:
bycomp.mean()

           Sales
Company
FACEBOOK   296.5
GOOGLE     160.0
MICROSOFT  232.0

In [17]:
bycomp.sum()

           Sales
Company
FACEBOOK     593
GOOGLE       320
MICROSOFT    464

In [18]:
bycomp.std()

                Sales
Company
FACEBOOK    75.660426
GOOGLE      56.568542
MICROSOFT  152.735065

In [19]:
bycomp.sum().loc['FACEBOOK']

Sales    593
Name: FACEBOOK, dtype: int64

In [20]:
bycomp.count()

           Person  Sales
Company
FACEBOOK        2      2
GOOGLE          2      2
MICROSOFT       2      2

In [21]:
bycomp.max()

            Person  Sales
Company
FACEBOOK     Sarah    350
GOOGLE         Sam    200
MICROSOFT  Venessa    340

In [22]:
bycomp.min()

            Person  Sales
Company
FACEBOOK      Carl    243
GOOGLE     Charlie    120
MICROSOFT      Amy    124

In [25]:
bycomp.describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOGLE, dtype: float64

# PANDAS PRACTICE

In [26]:
import numpy as np

import pandas as pd

In [27]:
datap = { 'Names':['Hrithik','Shubham','Ridhima','Kiran','Yugal','Amy','Dani','Nina','Ojasvi'],
          'Branch':['CSE','CSE','FT','BT','CSE','FT','BT','FT','BT'],
          'Salary (1000 $)':[132,120,110,132,120,130,98,99,100]
    
}

In [28]:
dfp = pd.DataFrame(datap)

In [29]:
dfp

     Names Branch  Salary (1000 $)
0  Hrithik    CSE              132
1  Shubham    CSE              120
2  Ridhima     FT              110
3    Kiran     BT              132
4    Yugal    CSE              120
5      Amy     FT              130
6     Dani     BT               98
7     Nina     FT               99
8   Ojasvi     BT              100

In [33]:
dfp.groupby('Branch').sum()

        Salary (1000 $)
Branch
BT                  330
CSE                 372
FT                  339

In [39]:
dfp.groupby('Branch').mean()

        Salary (1000 $)
Branch
BT                  110
CSE                 124
FT                  113

In [45]:
dfp.groupby('Names').max()

        Branch  Salary (1000 $)
Names
Amy         FT              130
Dani        BT               98
Hrithik    CSE              132
Kiran       BT              132
Nina        FT               99
Ojasvi      BT              100
Ridhima     FT              110
Shubham    CSE              120
Yugal      CSE              120

In [49]:
dfp.groupby('Branch').mean()

        Salary (1000 $)
Branch
BT                  110
CSE                 124
FT                  113

In [52]:
dfp.groupby('Branch').describe().transpose()

Branch                         BT         CSE          FT
Salary (1000 $) count    3.000000    3.000000    3.000000
                mean   110.000000  124.000000  113.000000
                std     19.078784    6.928203   15.716234
                min     98.000000  120.000000   99.000000
                25%     99.000000  120.000000  104.500000
                50%    100.000000  120.000000  110.000000
                75%    116.000000  126.000000  120.000000
                max    132.000000  132.000000  130.000000

In [53]:
dfp

     Names Branch  Salary (1000 $)
0  Hrithik    CSE              132
1  Shubham    CSE              120
2  Ridhima     FT              110
3    Kiran     BT              132
4    Yugal    CSE              120
5      Amy     FT              130
6     Dani     BT               98
7     Nina     FT               99
8   Ojasvi     BT              100

In [56]:
dfp.groupby('Branch').describe().transpose()[['CSE','BT']]

Branch                        CSE          BT
Salary (1000 $) count    3.000000    3.000000
                mean   124.000000  110.000000
                std      6.928203   19.078784
                min    120.000000   98.000000
                25%    120.000000   99.000000
                50%    120.000000  100.000000
                75%    126.000000  116.000000
                max    132.000000  132.000000

In [59]:
dfp.groupby('Branch').describe().transpose()['FT']

Salary (1000 $)  count      3.000000
                 mean     113.000000
                 std       15.716234
                 min       99.000000
                 25%      104.500000
                 50%      110.000000
                 75%      120.000000
                 max      130.000000
Name: FT, dtype: float64